Tekla Open API Reference for Tekla Structures 2025
CatalogItemEnumeratorInitializationException Class
 The CatalogItemEnumeratorInitializationException class represents an error that occurred during the catalog item enumerator initialization. This class cannot be inherited.
Inheritance Hierarchy
System.Object
 System.Exception
 Tekla.Structures.Catalogs.CatalogItemEnumeratorInitializationException
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class CatalogItemEnumeratorInitializationException : Exception
<SerializableAttribute>
Public NotInheritable Class CatalogItemEnumeratorInitializationException
	Inherits Exception
See Also
Reference
Tekla.Structures.Catalogs Namespace